#include "українізатор.укр"
#include вивід

ціле база(){
    ціле масив[чотири] = {один, чотири, вісім, вісім};
    константа РОЗМІР = чотири;
    ціле мінімум = найменьше(масив, РОЗМІР);
    вивести("Minimum >> %i", мінімум);
}

ціле найменьше(ціле масив[], ціле РОЗМІР){
    ціле мінімум = масив[нуль];
    для(ціле ї = 0; ї менше РОЗМІР; ї++){
        якщо(масив[ї] менше мінімум)
            мінімум = масив[ї];
    }
    оддай мінімум;
}
ціле найбільше(ціле масив[], ціле РОЗМІР){
    ціле максимум = масив[нуль];
    для(ціле ї = 0; ї менше РОЗМІР; ї++){
        якщо(масив[ї] більше максимум)
            максимум = масив[ї];
    }
    оддай максимум;
}